ansible_cucm/cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addSipTrunkSecurityProfile.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addSipTrunkSecurityProfile sequence="?">
         <sipTrunkSecurityProfile>
             <name>IWGs Encrypted SIP Trunk Profile</name>
             <description>IWGs Encrypted SIP Trunk Profile</description>
             <securityMode>Encrypted</securityMode>
             <incomingTransport>TLS</incomingTransport>
             <outgoingTransport>TLS</outgoingTransport>
             <digestAuthentication>false</digestAuthentication>
             <noncePolicyTime>600</noncePolicyTime>
             <incomingPort>5061</incomingPort>
             <appLevelAuthentication>false</appLevelAuthentication>
             <acceptPresenceSubscription>true</acceptPresenceSubscription>
             <acceptOutofDiaglogRefer>true</acceptOutofDiaglogRefer>
             <acceptUnsolicitedNotification>true</acceptUnsolicitedNotification>
             <allowReplaceHeader>true</allowReplaceHeader> 
             <transmitSecurityStatus>false</transmitSecurityStatus>
             <sipV150OutboundSdpOfferFiltering>Use Default Filter</sipV150OutboundSdpOfferFiltering>
             <allowChargingHeader>false</allowChargingHeader>
         </sipTrunkSecurityProfile>
      </ns:addSipTrunkSecurityProfile>
   </soapenv:Body>
</soapenv:Envelope>

